---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.PlanRegionFailures.DeletedViewRangeLevel
source: html/6987ef53-9088-1f15-ec73-fa66e5975744.htm
---
# Autodesk.Revit.DB.BuiltInFailures.PlanRegionFailures.DeletedViewRangeLevel Property

Deleted level was used to define plan region's view range.\r\nReplace deleted level by level of parent view and adjust offset?

## Syntax (C#)
```csharp
public static FailureDefinitionId DeletedViewRangeLevel { get; }
```